Revit 2027 API
RevitLinkType.IsFromLocalPath Method
 Checks whether the Revit link uses a local path, such as a hard drive.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFromLocalPath()
Public Function IsFromLocalPath As Boolean
public:
bool IsFromLocalPath()
member IsFromLocalPath : unit -> bool
Return Value
Boolean
 Returns true if the Revit link is from a local drive.
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace